In [8]:
from collections import OrderedDict

In [11]:
print('hello')

hello

In [12]:
t = int(input())
for _ in range(t):
    r, c = map(int, input().split())
    arr = list(map(int, input().split()))
    grid = []
    for i in range(0, r*c, c):
        grid.append(arr[i:i+c])
    print(grid)

[[2, 1, 0, 2, 1], [1, 0, 1, 2, 1], [1, 0, 0, 2, 1]]

In [10]:
from queue import Queue
q = Queue()
q.put('a')
# q.put('b')
# q.put('c')
print(q.get())
print(q.qsize())
print(q.queue[0])

a
0

IndexError: deque index out of range

In [3]:
import numpy as np
import pandas as pd
roll_no = np.arange(1, 11)
names = ['Hiren', 'Jay', 'Hitesh', 'Kevin', 'Jaya', 'Kamini', 'Lata', 'Aisha', 'Ashwin', 'Billu']
places = ['Citylight', 'Athwalines', 'Adajan', 'Rander', 'Piplod', 'Citylight', 'Athwalines', 'Adajan', 'Rander',
          'Piplod']
df = pd.DataFrame({'Roll_no': roll_no, 'Name': names, 'Place': places})
gender ={'Hiren': 'Male', 'Jay': 'Male', 'Jaya': 'Female', 'Hitesh': 'Male', 'Kevin': 'Male', 'Kamini': 'Female',
 'Lata': 'Female', 'Aisha': 'Female',
 'Ashwin': 'Male', 'Billu': 'Male'}
df['Gender'] = df['Name'].map(gender)
df['marks_PDS'] = pd.Series(np.random.randint(30, 101, 10))
df['marks_CC'] = pd.Series(np.random.randint(30, 101, 10))
df = df.set_index(roll_no)
display(df)
print()
display(df.agg(['mean', 'median', 'min', 'max', 'std']))
print()
print("Correlation:")
display(df.corr())

    Roll_no    Name       Place  Gender  marks_PDS  marks_CC
1         1   Hiren   Citylight    Male         35        78
2         2     Jay  Athwalines    Male         52        72
3         3  Hitesh      Adajan    Male         82        36
4         4   Kevin      Rander    Male         67        71
5         5    Jaya      Piplod  Female         96        87
6         6  Kamini   Citylight  Female         85        72
7         7    Lata  Athwalines  Female         56        72
8         8   Aisha      Adajan  Female         67        84
9         9  Ashwin      Rander    Male         81        85
10       10   Billu      Piplod    Male         53        89

         Roll_no   Name   Place  Gender  marks_PDS   marks_CC
mean     5.50000    NaN     NaN     NaN  67.400000  74.600000
median   5.50000    NaN     NaN     NaN  67.000000  75.000000
min      1.00000  Aisha  Adajan  Female  35.000000  36.000000
max     10.00000   Lata  Rander    Male  96.000000  89.000000
std      3.02765    NaN     NaN     NaN  18.709475  15.247586

Correlation:

            Roll_no  marks_PDS  marks_CC
Roll_no    1.000000   0.241266  0.503034
marks_PDS  0.241266   1.000000 -0.141540
marks_CC   0.503034  -0.141540  1.000000

In [6]:
import numpy as np
import pandas as pd

roll_no = np.arange(1, 11)
names = ['Hiren', 'Jay', 'Hitesh', 'Kevin', 'Jaya', 'Kamini', 'Lata', 'Aisha', 'Ashwin', 'Billu']
places = ['Citylight', 'Athwalines', 'Adajan', 'Rander', 'Piplod', 'Citylight', 'Athwalines', 'Adajan', 'Rander',
          'Pi plod']
df = pd.DataFrame({'Roll_no': roll_no, 'Name': names, 'Place': places})
gender ={'Hiren': 'Male', 'Jay': 'Male', 'Jaya': 'Female', 'Hitesh': 'Male', 'Kevin': 'Male', 'Kamini': 'Female',
 'Lata': 'Female', 'Aisha': 'Female',
 'Ashwin': 'Male', 'Billu': 'Male'}


df['Gender'] = df['Name'].map(gender)
df['marks_PDS'] = pd.Series(np.random.randint(30, 101, 10))
df['marks_CC'] = pd.Series(np.random.randint(30, 101, 10))
df = df.set_index(roll_no)

display(df.groupby('Place').count())
display(df.groupby('Place')['Gender'].value_counts())

            Roll_no  Name  Gender  marks_PDS  marks_CC
Place
Adajan            2     2       2          2         2
Athwalines        2     2       2          2         2
Citylight         2     2       2          2         2
Pi plod           1     1       1          1         1
Piplod            1     1       1          1         1
Rander            2     2       2          2         2

Place       Gender
Adajan      Female    1
            Male      1
Athwalines  Female    1
            Male      1
Citylight   Female    1
            Male      1
Pi plod     Male      1
Piplod      Female    1
Rander      Male      2
Name: Gender, dtype: int64

In [7]:
import numpy as np
import pandas as pd

roll_no = np.arange(1, 11)
names = ['Hiren', 'Jay', 'Hitesh', 'Kevin', 'Jaya', 'Kamini', 'Lata', 'Aisha', 'Ashwin', 'Billu']
places = ['Citylight', 'Athwalines', 'Adajan', 'Rander', 'Piplod', 'Citylight', 'Athwalines', 'Adajan', 'Rander',
          'Pi plod']
df = pd.DataFrame({'Roll_no': roll_no, 'Name': names, 'Place': places})
gender ={'Hiren': 'Male', 'Jay': 'Male', 'Jaya': 'Female', 'Hitesh': 'Male', 'Kevin': 'Male', 'Kamini': 'Female',
 'Lata': 'Female', 'Aisha': 'Female',
 'Ashwin': 'Male', 'Billu': 'Male'}


df['Gender'] = df['Name'].map(gender)
df['marks_PDS'] = pd.Series(np.random.randint(30, 101, 10))
df['marks_CC'] = pd.Series(np.random.randint(30, 101, 10))
df = df.set_index(roll_no)
display(df.groupby('Gender').get_group('Male'))
display(df.groupby('Gender')['marks_PDS'].agg(['sum','mean','median','std']))
display(df.groupby('Gender')['marks_PDS'].agg(['size']))
df.groupby('Place')['Place'].apply(lambda x:x.count()>2)
func =lambda x: (x - x.mean()) / x.std()*10
score = df[['marks_PDS','marks_CC']].apply(func)
display(score)

    Roll_no    Name       Place Gender  marks_PDS  marks_CC
1         1   Hiren   Citylight   Male         67        34
2         2     Jay  Athwalines   Male         99        73
3         3  Hitesh      Adajan   Male         36        97
4         4   Kevin      Rander   Male         31        32
9         9  Ashwin      Rander   Male         79        81
10       10   Billu     Pi plod   Male         83        34

        sum       mean  median        std
Gender
Female  243  60.750000      52  25.578311
Male    395  65.833333      73  27.102890

        size
Gender
Female     4
Male       6

    marks_PDS   marks_CC
1    1.271819  -7.795165
2   13.990007   7.636888
3  -11.048926  17.133536
4  -13.036143  -8.586553
5   -6.279606   9.219662
6   -3.100058  -7.003778
7   13.592564  -4.629616
8   -9.061709  -8.982246
9    6.041140  10.802437
10   7.630913  -7.795165